In [1]:
import numpy as np
import pandas as pd

In [2]:
df = pd.DataFrame({"key1" : ["a", "a", None, "b", "b", "a", None],
                       "key2" : pd.Series([1, 2, 1, 2, 1, None, 1], dtype="Int64"),"data1" : np.random.standard_normal(7),
                       "data2" : np.random.standard_normal(7)})

In [3]:
df

   key1  key2     data1     data2
0     a     1  0.915397 -0.855327
1     a     2 -1.890311  0.415022
2  None     1 -0.868569 -0.286906
3     b     2 -1.983359 -0.949026
4     b     1 -0.461458  0.433763
5     a  <NA>  0.751277 -1.260667
6  None     1 -0.876843 -1.418954

In [4]:
grouped = df["data1"].groupby(df["key1"])
grouped

In [5]:
grouped.mean()

key1
a   -0.074546
b   -1.222408
Name: data1, dtype: float64

In [6]:
means = df["data1"].groupby([df["key1"], df["key2"]]).mean()
means

key1  key2
a     1       0.915397
      2      -1.890311
b     1      -0.461458
      2      -1.983359
Name: data1, dtype: float64

In [10]:
states = np.array(["OH", "CA", "CA", "OH", "OH", "CA", "OH"])
years = [2005, 2005, 2006, 2005, 2006, 2005, 2006]
df["data1"].groupby([states, years]).mean()

CA  2005   -0.569517
    2006   -0.868569
OH  2005   -0.533981
    2006   -0.669150
Name: data1, dtype: float64

In [11]:
df.groupby("key1").mean()

      key2     data1     data2
key1
a      1.5 -0.074546 -0.566991
b      1.5 -1.222408 -0.257632

In [12]:
df.groupby("key2").mean()

         data1     data2
key2
1    -0.322868 -0.531856
2    -1.936835 -0.267002

In [13]:
df.groupby("key1")["data1"]
df["data1"].groupby(df["key1"])

In [14]:
df.groupby("key1")[["data2"]]
df[["data2"]].groupby(df["key1"])

In [16]:
grouped = df.groupby("key1")
grouped["data1"].nsmallest(2)

key1
a     1   -1.890311
      5    0.751277
b     3   -1.983359
      4   -0.461458
Name: data1, dtype: float64

In [17]:
grouped.describe()

      key2                                           data1            ...  \
     count mean       std  min   25%  50%   75%  max count      mean  ...
key1                                                                  ...
a      2.0  1.5  0.707107  1.0  1.25  1.5  1.75  2.0   3.0 -0.074546  ...
b      2.0  1.5  0.707107  1.0  1.25  1.5  1.75  2.0   2.0 -1.222408  ...

                         data2                                          \
           75%       max count      mean       std       min       25%
key1
a     0.833337  0.915397   3.0 -0.566991  0.874264 -1.260667 -1.057997
b    -0.841933 -0.461458   2.0 -0.257632  0.977779 -0.949026 -0.603329


           50%       75%       max
key1
a    -0.855327 -0.220153  0.415022
b    -0.257632  0.088066  0.433763

[2 rows x 24 columns]

In [18]:
frame = pd.DataFrame({"data1": np.random.standard_normal(1000),
                          "data2": np.random.standard_normal(1000)})

In [19]:
frame.head()

      data1     data2
0 -0.965663  0.197369
1 -0.703861 -1.036142
2  1.274766  1.770335
3 -1.127306 -1.069959
4 -0.300156 -0.250066

In [20]:
quartiles = pd.cut(frame["data1"], 4)

In [21]:
quartiles

0      (-1.825, -0.252]
1      (-1.825, -0.252]
2       (-0.252, 1.322]
3      (-1.825, -0.252]
4      (-1.825, -0.252]
             ...
995    (-1.825, -0.252]
996    (-1.825, -0.252]
997    (-3.405, -1.825]
998     (-0.252, 1.322]
999    (-1.825, -0.252]
Name: data1, Length: 1000, dtype: category
Categories (4, interval[float64]): [(-3.405, -1.825] < (-1.825, -0.252] < (-0.252, 1.322] < (1.322, 2.895]]

In [22]:
def get_stats(group):
        return pd.DataFrame(
            {"min": group.min(), "max": group.max(),
            "count": group.count(), "mean": group.mean()}
        )

In [23]:
grouped = frame.groupby(quartiles)
grouped.apply(get_stats)

                             min       max  count      mean
data1
(-3.405, -1.825] data1 -3.398289 -1.839918     32 -2.286940
                 data2 -2.052529  3.240582     32  0.479124
(-1.825, -0.252] data1 -1.812391 -0.253907    396 -0.808920
                 data2 -2.978199  2.844781    396  0.018664
(-0.252, 1.322]  data1 -0.248663  1.297220    483  0.404723
                 data2 -3.261301  3.200562    483  0.029001
(1.322, 2.895]   data1  1.322943  2.894763     89  1.716104
                 data2 -2.714297  3.111624     89  0.059449

In [24]:
grouped.agg(["min", "max", "count", "mean"])

                     data1                               data2            \
                       min       max count      mean       min       max
data1
(-3.405, -1.825] -3.398289 -1.839918    32 -2.286940 -2.052529  3.240582
(-1.825, -0.252] -1.812391 -0.253907   396 -0.808920 -2.978199  2.844781
(-0.252, 1.322]  -0.248663  1.297220   483  0.404723 -3.261301  3.200562
(1.322, 2.895]    1.322943  2.894763    89  1.716104 -2.714297  3.111624


                 count      mean
data1
(-3.405, -1.825]    32  0.479124
(-1.825, -0.252]   396  0.018664
(-0.252, 1.322]    483  0.029001
(1.322, 2.895]      89  0.059449

In [25]:
s = pd.Series(np.random.standard_normal(6))
s[::2] = np.nan
s

0         NaN
1    0.385125
2         NaN
3   -0.096705
4         NaN
5   -0.617869
dtype: float64

In [26]:
s.fillna(s.mean())

0   -0.109817
1    0.385125
2   -0.109817
3   -0.096705
4   -0.109817
5   -0.617869
dtype: float64

In [27]:
suits = ["H", "S", "C", "D"]  # Hearts, Spades, Clubs, Diamonds
card_val = (list(range(1, 11)) + [10] * 3) * 4
base_names = ["A"] + list(range(2, 11)) + ["J", "K", "Q"]
cards = []
for suit in suits:
    cards.extend(str(num) + suit for num in base_names)

deck = pd.Series(card_val, index=cards)

In [28]:
deck.head(13)

AH      1
2H      2
3H      3
4H      4
5H      5
6H      6
7H      7
8H      8
9H      9
10H    10
JH     10
KH     10
QH     10
dtype: int64

In [30]:
def draw(deck, n=5):
    return deck.sample(n)

In [31]:
draw(deck)

QH    10
KC    10
QS    10
2S     2
4S     4
dtype: int64

In [33]:
conda install statsmodels

Collecting package metadata (current_repodata.json): ...working... done
Solving environment: ...working... done

# All requested packages already installed.

Retrieving notices: ...working... done

Note: you may need to restart the kernel to use updated packages.

In [34]:
import statsmodels.api as sm
def regress(data, yvar=None, xvars=None):
    Y = data[yvar]
    X = data[xvars]
    X["intercept"] = 1.
    result = sm.OLS(Y, X).fit()
    return result.params

##